import streamlit as st

st.title('내 키는 평균일까?')

height = st.text_input('키를 입력해주세요 : ')
year_sex = st.selectbox('나이와 성별을 선택해주세요 : ', [
  '중1-남', '중2-남', '중3-남', '고1-남', '고2-남', '고3-남',
  '중1-여', '중2-여', '중3-여', '고1-여', '고2-여', '고3-여'
])

average_height = {
  '중1-남' : {
    '평균키'  : '160.4'
  },
  '중2-남' : {
    '평균키'  : '166.3'
  },
  '중3-남' : {
    '평균키'  : '170.2'
  },
  '고1-남' : {
    '평균키'  : '172.6'
  },
  '고2-남' : {
    '평균키'  : '173.3'
  },
  '고3-남' : {
    '평균키'  : '173.8'
  },
  '중1-여' : {
    '평균키'  : '156.9'
  },
  '중2-여' : {
    '평균키'  : '158.9'
  },
  '중3-여' : {
    '평균키'  : '160.3'
  },
  '고1-여' : {
    '평균키'  : '160.9'
  },
  '고2-여' : {
    '평균키'  : '160.9'
  },
  '고3-여' : {
    '평균키'  : '160.9'
  }
}

if st.button('평균키 계산'):
    if height in average_height:
        if height > average_height:
          st.write("당신의 키는 평균보다 큽니다.")
    elif height < average_height:
      st.write("당신의 키는 평균보다 작습니다.")
    else:
      st.write("당신의 키는 평균입니다.")
